witalis3/UA3REO-DDC-Transceiver/STM32/Src/wifi.c
#include "wifi.h"
#include "main.h"
#include "stm32h7xx_hal.h"
#include "functions.h"
#include "settings.h"
#include "trx_manager.h"
#include "lcd.h"
#include <stdlib.h>
#include "usbd_cat_if.h"

static WiFiProcessingCommand WIFI_ProcessingCommand = WIFI_COMM_NONE;
static void (*WIFI_ProcessingCommandCallback)(void);

static SRAM char WIFI_AnswerBuffer[WIFI_ANSWER_BUFFER_SIZE] = {0};
static IRAM2 char WIFI_readedLine[WIFI_LINE_BUFFER_SIZE] = {0};
static IRAM2 char tmp[WIFI_LINE_BUFFER_SIZE] = {0};
static IRAM2 int16_t WIFI_RLEStreamBuffer[WIFI_RLE_BUFFER_SIZE] = {0};
static IRAM2 uint16_t WIFI_RLEStreamBuffer_index = 0;
static IRAM2 uint16_t WIFI_RLEStreamBuffer_part = 0;
static uint32_t WIFI_Answer_ReadIndex = 0;
static uint32_t commandStartTime = 0;
static uint8_t WIFI_FoundedAP_Index = 0;
static bool WIFI_stop_auto_ap_list = false;

static void WIFI_SendCommand(char *command);
static bool WIFI_WaitForOk(void);
static bool WIFI_ListAP_Sync(void);
static bool WIFI_TryGetLine(void);
static void WIFI_sendHTTPRequest(void);
static void WIFI_getHTTPResponse(void);
static void WIFI_printImage_stream_callback(void);
static void WIFI_printImage_stream_partial_callback(void);

bool WIFI_connected = false;
bool WIFI_CAT_server_started = false;
volatile WiFiState WIFI_State = WIFI_UNDEFINED;
static char WIFI_FoundedAP_InWork[WIFI_FOUNDED_AP_MAXCOUNT][MAX_WIFIPASS_LENGTH] = {0};
volatile char WIFI_FoundedAP[WIFI_FOUNDED_AP_MAXCOUNT][MAX_WIFIPASS_LENGTH] = {0};
bool WIFI_IP_Gotted = false;
char WIFI_IP[15] = {0};
static uint16_t WIFI_HTTP_Response_Status = 0;
static uint32_t WIFI_HTTP_Response_ContentLength = 0;
IRAM2 static char WIFI_HOSTuri[128] = {0};
IRAM2 static char WIFI_GETuri[128] = {0};
IRAM2 static char WIFI_HTTRequest[128] = {0};
IRAM2 static char WIFI_HTTResponseHTML[WIFI_HTML_RESP_BUFFER_SIZE] = {0};

void WIFI_Init(void)
{
	//wifi uart speed = 115200 * 8 = 921600  / * 16 = 1843200
	WIFI_SendCommand("AT+UART_CUR=921600,8,1,0,1\r\n"); //uart config
	WIFI_WaitForOk();
	huart6.Init.BaudRate = 921600;
	HAL_UART_Init(&huart6);

	WIFI_SendCommand("ATE0\r\n"); //echo off
	WIFI_WaitForOk();
	WIFI_SendCommand("AT+GMR\r\n"); //system info ESP8266
	WIFI_WaitForOk();
	/*
	AT version:1.7.4.0(May 11 2020 19:13:04)
	SDK version:3.0.4(9532ceb)
	compile time:May 27 2020 10:12:20
	Bin version(Wroom 02):1.7.4
	*/
	WIFI_SendCommand("AT\r\n");
	WIFI_WaitForOk();
	if (strstr(WIFI_readedLine, "OK") != NULL)
	{
		println("[WIFI] WIFI Module Inited");
		WIFI_State = WIFI_INITED;

		// check if there are active connections, if yes - don't create a new one
		WIFI_SendCommand("AT+CIPSTATUS\r\n");
		while (WIFI_TryGetLine())
		{
			if (strstr(WIFI_readedLine, "STATUS:2") != NULL)
			{
				WIFI_SendCommand("AT+CWAUTOCONN=1\r\n"); //AUTOCONNECT
				WIFI_WaitForOk();
				WIFI_State = WIFI_READY;
				WIFI_connected = true;
				LCD_UpdateQuery.StatusInfoGUI = true;
				println("[WIFI] Connected");
			}
		}
	}
	if (WIFI_State == WIFI_UNDEFINED)
	{
		WIFI_State = WIFI_NOTFOUND;
		println("[WIFI] WIFI Module Not Found");
	}
}

void WIFI_Process(void)
{
	static IRAM2 char com_t[128] = {0};
	static IRAM2 char tz[2] = {0};
	static IRAM2 char com[128] = {0};
	memset(com_t, 0x00, sizeof(com_t));
	memset(tz, 0x00, sizeof(tz));
	memset(com, 0x00, sizeof(com));
	
	if (WIFI_State == WIFI_NOTFOUND)
		return;
	if (WIFI_State == WIFI_UNDEFINED)
	{
		WIFI_Init();
		return;
	}

	/////////

	switch (WIFI_State)
	{
	case WIFI_INITED:
		//sendToDebug_str3("[WIFI] Start connecting to AP: ", TRX.WIFI_AP, "\r\n");
		WIFI_SendCommand("AT+CWAUTOCONN=0\r\n"); //AUTOCONNECT OFF
		WIFI_WaitForOk();
		WIFI_SendCommand("AT+RFPOWER=82\r\n"); //rf power
		WIFI_WaitForOk();
		WIFI_SendCommand("AT+CWMODE=1\r\n"); //station mode
		WIFI_WaitForOk();
		WIFI_SendCommand("AT+CWDHCP=1,1\r\n"); //DHCP
		WIFI_WaitForOk();
		WIFI_SendCommand("AT+CIPDNS_CUR=1,\"8.8.8.8\"\r\n"); //DNS
		WIFI_WaitForOk();
		WIFI_SendCommand("AT+CWHOSTNAME=\"UA3REO\"\r\n"); //Hostname
		WIFI_WaitForOk();
		//WIFI_SendCommand("AT+CWCOUNTRY=1,\"RU\",1,13\r\n"); //Country
		//WIFI_WaitForOk();
		//WIFI_SendCommand("AT+CIPSERVER=0\r\n"); //Stop CAT Server
		//WIFI_WaitForOk();
		WIFI_SendCommand("AT+CIPMUX=1\r\n"); //Multiple server connections
		WIFI_WaitForOk();
		WIFI_SendCommand("AT+CIPSERVERMAXCONN=3\r\n"); //Max server connections
		WIFI_WaitForOk();
		WIFI_SendCommand("AT+CIPSSLSIZE=4096\r\n"); //SSL size
		WIFI_WaitForOk();
		WIFI_SendCommand("AT+CIPSSLCCONF=2\r\n"); //SSL config
		WIFI_WaitForOk();
		WIFI_SendCommand("AT+CIPRECVMODE=0\r\n"); //TCP receive passive mode
		WIFI_WaitForOk();

		strcat(com_t, "AT+CIPSNTPCFG=1,");
		sprintf(tz, "%d", TRX.WIFI_TIMEZONE);
		strcat(com_t, tz);
		strcat(com_t, ",\"0.pool.ntp.org\",\"1.pool.ntp.org\"\r\n");
		WIFI_SendCommand(com_t); //configure SNMP
		WIFI_WaitForOk();

		WIFI_stop_auto_ap_list = false;
		WIFI_IP_Gotted = false;
		WIFI_State = WIFI_CONFIGURED;
		break;
	case WIFI_CONFIGURED:
		if (strcmp(TRX.WIFI_AP1, "WIFI-AP") == 0 && strcmp(TRX.WIFI_AP2, "WIFI-AP") == 0 && strcmp(TRX.WIFI_AP3, "WIFI-AP") == 0 &&
			strcmp(TRX.WIFI_PASSWORD1, "WIFI-PASSWORD") == 0 && strcmp(TRX.WIFI_PASSWORD2, "WIFI-PASSWORD") == 0 && strcmp(TRX.WIFI_PASSWORD3, "WIFI-PASSWORD") == 0)
			break;
		if (WIFI_stop_auto_ap_list)
			break;
		WIFI_ListAP_Sync();
		bool AP1_exist = false;
		bool AP2_exist = false;
		bool AP3_exist = false;
		for (uint8_t i = 0; i < WIFI_FOUNDED_AP_MAXCOUNT; i++)
		{
			if (strcmp((char *)WIFI_FoundedAP[i], TRX.WIFI_AP1) == 0)
				AP1_exist = true;
			else if (strcmp((char *)WIFI_FoundedAP[i], TRX.WIFI_AP2) == 0)
				AP2_exist = true;
			else if (strcmp((char *)WIFI_FoundedAP[i], TRX.WIFI_AP3) == 0)
				AP3_exist = true;
		}
		if (AP1_exist && strlen(TRX.WIFI_PASSWORD1) > 5)
		{
			println("[WIFI] Start connecting to AP1: ", TRX.WIFI_AP1);
			strcat(com, "AT+CWJAP_CUR=\"");
			strcat(com, TRX.WIFI_AP1);
			strcat(com, "\",\"");
			strcat(com, TRX.WIFI_PASSWORD1);
			strcat(com, "\"\r\n");
			WIFI_SendCommand(com); //connect to AP
			//WIFI_WaitForOk();
			WIFI_State = WIFI_CONNECTING;
		}
		if (AP2_exist && strlen(TRX.WIFI_PASSWORD2) > 5)
		{
			println("[WIFI] Start connecting to AP2: ", TRX.WIFI_AP2);
			strcat(com, "AT+CWJAP_CUR=\"");
			strcat(com, TRX.WIFI_AP2);
			strcat(com, "\",\"");
			strcat(com, TRX.WIFI_PASSWORD2);
			strcat(com, "\"\r\n");
			WIFI_SendCommand(com); //connect to AP
			//WIFI_WaitForOk();
			WIFI_State = WIFI_CONNECTING;
		}
		if (AP3_exist && strlen(TRX.WIFI_PASSWORD3) > 5)
		{
			println("[WIFI] Start connecting to AP: ", TRX.WIFI_AP3);
			strcat(com, "AT+CWJAP_CUR=\"");
			strcat(com, TRX.WIFI_AP3);
			strcat(com, "\",\"");
			strcat(com, TRX.WIFI_PASSWORD3);
			strcat(com, "\"\r\n");
			WIFI_SendCommand(com); //connect to AP
			//WIFI_WaitForOk();
			WIFI_State = WIFI_CONNECTING;
		}
		break;

	case WIFI_CONNECTING:
		WIFI_TryGetLine();
		if (strstr(WIFI_readedLine, "GOT IP") != NULL)
		{
			println("[WIFI] Connected");
			WIFI_SendCommand("AT+CWAUTOCONN=1\r\n"); //AUTOCONNECT
			WIFI_WaitForOk();
			WIFI_State = WIFI_READY;
			WIFI_connected = true;
			LCD_UpdateQuery.StatusInfoGUI = true;
		}
		if (strstr(WIFI_readedLine, "WIFI DISCONNECT") != NULL)
		{
			println("[WIFI] Disconnected");
			//WIFI_State = WIFI_CONFIGURED;
			WIFI_connected = false;
			LCD_UpdateQuery.StatusInfoGUI = true;
		}
		if (strstr(WIFI_readedLine, "FAIL") != NULL)
		{
			println("[WIFI] Connect failed");
			WIFI_State = WIFI_CONFIGURED;
			WIFI_connected = false;
			LCD_UpdateQuery.StatusInfoGUI = true;
		}
		if (strstr(WIFI_readedLine, "ERROR") != NULL)
		{
			println("[WIFI] Connect error");
			WIFI_State = WIFI_CONFIGURED;
			WIFI_connected = false;
			LCD_UpdateQuery.StatusInfoGUI = true;
		}
		break;

	case WIFI_READY:
		WIFI_TryGetLine();
		WIFI_ProcessingCommandCallback = 0;
		//receive commands from WIFI clients
		if (strstr(WIFI_readedLine, "+IPD") != NULL && WIFI_ProcessingCommand != WIFI_COMM_TCP_GET_RESPONSE)
		{
			char *wifi_incoming_link_id = strchr(WIFI_readedLine, ',');
			if (wifi_incoming_link_id == NULL)
				break;
			wifi_incoming_link_id++;

			char *wifi_incoming_length = strchr(wifi_incoming_link_id, ',');
			if (wifi_incoming_length == NULL)
				break;
			*wifi_incoming_length = 0x00;
			wifi_incoming_length++;

			char *wifi_incoming_data = strchr(wifi_incoming_length, ':');
			if (wifi_incoming_data == NULL)
				break;
			*wifi_incoming_data = 0x00;
			wifi_incoming_data++;

			uint32_t wifi_incoming_length_uint = (uint32_t)atoi(wifi_incoming_length);
			uint32_t wifi_incoming_link_id_uint = (uint32_t)atoi(wifi_incoming_link_id);
			if (wifi_incoming_length_uint > 64)
				wifi_incoming_length_uint = 64;
			if (wifi_incoming_length_uint > 0)
				wifi_incoming_length_uint--; //del /n char
			if (wifi_incoming_link_id_uint > 8)
				wifi_incoming_link_id_uint = 8;

			char *wifi_incoming_data_end = wifi_incoming_data + wifi_incoming_length_uint;
			*wifi_incoming_data_end = 0x00;

			if (WIFI_DEBUG)
				println("[WIFI] Command received: ", wifi_incoming_data);
			if (wifi_incoming_length_uint > 0)
				CAT_SetWIFICommand(wifi_incoming_data, wifi_incoming_length_uint, wifi_incoming_link_id_uint);
		}
		if (strstr(WIFI_readedLine, "WIFI DISCONNECT") != NULL)
		{
			println("[WIFI] Disconnected");
			WIFI_State = WIFI_CONFIGURED;
			WIFI_connected = false;
			WIFI_IP_Gotted = false;
			LCD_UpdateQuery.StatusInfoGUI = true;
		}
		break;

	case WIFI_TIMEOUT:
		WIFI_TryGetLine();
		if (WIFI_connected)
			WIFI_State = WIFI_READY;
		else
			WIFI_State = WIFI_CONFIGURED;
		break;

	case WIFI_PROCESS_COMMAND:
		WIFI_TryGetLine();
		if ((HAL_GetTick() - commandStartTime) > WIFI_COMMAND_TIMEOUT)
		{
			WIFI_State = WIFI_TIMEOUT;
			WIFI_ProcessingCommand = WIFI_COMM_NONE;
		}
		else if (strstr(WIFI_readedLine, "OK") != NULL)
		{
			//ListAP Command Ended
			if (WIFI_ProcessingCommand == WIFI_COMM_LISTAP)
				for (uint8_t i = 0; i < WIFI_FOUNDED_AP_MAXCOUNT; i++)
				{
					strcpy((char *)&WIFI_FoundedAP[i], (char *)&WIFI_FoundedAP_InWork[i]);
					WIFI_stop_auto_ap_list = false;
				}
			//Create Server Command Ended
			if (WIFI_ProcessingCommand == WIFI_COMM_CREATESERVER)
			{
				WIFI_SendCommand("AT+CIPSTO=3600\r\n"); //Connection timeout
				WIFI_WaitForOk();
				WIFI_CAT_server_started = true;
				println("[WIFI] CAT Server started on port 6784");
				WIFI_State = WIFI_READY;
			}
			//SNTP Command Ended
			if (WIFI_ProcessingCommand == WIFI_COMM_GETSNTP)
			{
				WIFI_State = WIFI_READY;
			}
			//Get IP Command Ended
			if (WIFI_ProcessingCommand == WIFI_COMM_GETIP)
			{
				WIFI_State = WIFI_READY;
			}
			//TCP connect
			if (WIFI_ProcessingCommand == WIFI_COMM_TCP_CONNECT)
			{
				WIFI_sendHTTPRequest();
				return;
			}
			if (WIFI_ProcessingCommand == WIFI_COMM_TCP_GET_RESPONSE)
			{
				WIFI_getHTTPResponse();
				return;
			}
			//Some stuff
			if (WIFI_ProcessingCommandCallback != NULL)
			{
				WIFI_ProcessingCommandCallback();
			}
			WIFI_ProcessingCommand = WIFI_COMM_NONE;
		}
		else if (strlen(WIFI_readedLine) > 5) //read command output
		{
			if (WIFI_ProcessingCommand == WIFI_COMM_LISTAP) //ListAP Command process
			{
				char *start = strchr(WIFI_readedLine, '"');
				if (start != NULL)
				{
					start = start + 1;
					char *end = strchr(start, '"');
					if (end != NULL)
					{
						*end = 0x00;
						strcat((char *)&WIFI_FoundedAP_InWork[WIFI_FoundedAP_Index], start);
						if (WIFI_FoundedAP_Index < (WIFI_FOUNDED_AP_MAXCOUNT - 1))
							WIFI_FoundedAP_Index++;
					}
				}
			}
			else if (WIFI_ProcessingCommand == WIFI_COMM_GETSNTP) //Get and sync SNMP time
			{													  //Mon Jan 18 20:17:56 2021
				char *sntp_str = strchr(WIFI_readedLine, ' ');
				if (sntp_str != NULL)
				{
					sntp_str = sntp_str + 1;
					char *month_str = sntp_str;
					sntp_str = strchr(sntp_str, ' ');
					if (sntp_str != NULL)
					{
						*sntp_str = 0x00;
						sntp_str = sntp_str + 1;
						char *day_str = sntp_str;
						sntp_str = strchr(sntp_str, ' ');
						if (sntp_str != NULL)
						{
							*sntp_str = 0x00;
							sntp_str = sntp_str + 1;
							//hh:mm:ss here
							char *min_str = strchr(sntp_str, ':');
							if (min_str != NULL)
							{
								min_str = min_str + 1;
								char *sec_str = strchr(min_str, ':');
								char *year_str = strchr(min_str, ' ');
								char *end = strchr(sntp_str, ':');
								if (sec_str != NULL && year_str != NULL && end != NULL)
								{
									sec_str = sec_str + 1;
									year_str = year_str + 1;
									*end = 0x00;
									end = strchr(min_str, ':');
									if (end != NULL)
									{
										*end = 0x00;
										end = strchr(sec_str, ' ');
										if (end != NULL)
										{
											*end = 0x00;
											//split strings here
											uint8_t hrs = (uint8_t)atoi(sntp_str);
											uint8_t min = (uint8_t)atoi(min_str);
											uint8_t sec = (uint8_t)atoi(sec_str);
											uint16_t year = (uint16_t)atoi(year_str);
											uint16_t year_short = (uint16_t)atoi(year_str + 2);
											uint16_t month = 1;
											if (strstr(month_str, "Jan") != NULL)
												month = 1;
											if (strstr(month_str, "Feb") != NULL)
												month = 2;
											if (strstr(month_str, "Mar") != NULL)
												month = 3;
											if (strstr(month_str, "Apr") != NULL)
												month = 4;
											if (strstr(month_str, "May") != NULL)
												month = 5;
											if (strstr(month_str, "Jun") != NULL)
												month = 6;
											if (strstr(month_str, "Jul") != NULL)
												month = 7;
											if (strstr(month_str, "Aug") != NULL)
												month = 8;
											if (strstr(month_str, "Sep") != NULL)
												month = 9;
											if (strstr(month_str, "Oct") != NULL)
												month = 10;
											if (strstr(month_str, "Nov") != NULL)
												month = 11;
											if (strstr(month_str, "Dec") != NULL)
												month = 12;
											uint16_t day = (uint16_t)atoi(day_str);
											//save to RTC clock
											if (year > 2018)
											{
												RTC_TimeTypeDef sTime;
												sTime.TimeFormat = RTC_HOURFORMAT12_PM;
												sTime.SubSeconds = 0;
												sTime.SecondFraction = 0;
												sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
												sTime.StoreOperation = RTC_STOREOPERATION_SET;
												sTime.Hours = hrs;
												sTime.Minutes = min;
												sTime.Seconds = sec;
												RTC_DateTypeDef sDate;
												sDate.Date = day;
												sDate.Month = month;
												sDate.Year = year_short;
												BKPSRAM_Enable();
												HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
												HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BIN);
												TRX_SNTP_Synced = HAL_GetTick();
												println("[WIFI] TIME SYNCED");
											}
										}
									}
								}
							}
						}
					}
				}
			}
			else if (WIFI_ProcessingCommand == WIFI_COMM_GETIP) //GetIP Command process
			{
				char *sep = "_CUR:ip";
				char *istr;
				istr = strstr(WIFI_readedLine, sep);
				if (istr != NULL)
				{
					char *start = strchr(WIFI_readedLine, '"');
					if (start != NULL)
					{
						start = start + 1;
						char *end = strchr(start, '"');
						if (end != NULL)
						{
							*end = 0x00;
							strcat(WIFI_IP, start);
							println("[WIFI] GOT IP: ", WIFI_IP);
							WIFI_IP_Gotted = true;
						}
					}
				}
			}
			else if (WIFI_ProcessingCommand == WIFI_COMM_TCP_GET_RESPONSE) //GetIP Command process
			{
				char *istr;
				istr = strstr(WIFI_readedLine, "+IPD");
				if (istr != NULL)
					WIFI_getHTTPResponse();
			}
		}
		break;

