witalis3/UA3REO-DDC-Transceiver/STM32/Src/wifi.c
			//get status
			char *istr4 = strchr(WIFI_HTTResponseHTML, ' ');
			if (istr4 != NULL)
			{
				char *istr5 = istr4 + 4;
				*istr5 = 0;
				WIFI_HTTP_Response_Status = (uint16_t)(atoi(istr4));
				*istr5 = ' ';
			}

			//get content length
			istr4 = strstr(WIFI_HTTResponseHTML, "Content-Length: ");
			if (istr4 != NULL)
			{
				istr4 += 16;
				char *istr5 = strchr(istr4, '\r');
                if (istr5 != NULL)
                {
                    *istr5 = 0;
                    WIFI_HTTP_Response_ContentLength = (uint32_t)(atoi(istr4));
                    *istr5 = ' ';
                }
			}

			//get response body
			char *istr6 = strstr(WIFI_HTTResponseHTML, "\r\n\r\n");
			if (istr6 != NULL)
			{
				istr6 += 4;
				strcpy(WIFI_HTTResponseHTML, istr6);
			}

			//partial callback for image printing
			readed_body_length += strlen(WIFI_HTTResponseHTML);
			if (WIFI_ProcessingCommandCallback == WIFI_printImage_stream_callback)
				WIFI_printImage_stream_partial_callback();

			//may be partial content? continue downloading
			start_time = HAL_GetTick();
			if (readed_body_length < WIFI_HTTP_Response_ContentLength && (HAL_GetTick() - start_time) < 3000)
			{
				while (readed_body_length < WIFI_HTTP_Response_ContentLength && strlen(WIFI_HTTResponseHTML) < sizeof(WIFI_HTTResponseHTML) && (HAL_GetTick() - start_time) < 3000)
				{
					if (WIFI_TryGetLine())
					{
						istr = strstr(WIFI_readedLine, "+IPD");
						if (istr != NULL)
						{
							istr += 7;
							istr2 = strchr(WIFI_readedLine, ':');
							if (istr2 != NULL)
							{
								*istr2 = 0;
								response_length = atoi(istr);
								istr2++;
								strncat(WIFI_HTTResponseHTML, istr2, response_length);

								//partial callback for image printing
								readed_body_length += strlen(WIFI_HTTResponseHTML);
								if (WIFI_ProcessingCommandCallback == WIFI_printImage_stream_callback)
									WIFI_printImage_stream_partial_callback();
							}
						}
					}
				}
			}

			//cut body on content-length
			if (strlen(WIFI_HTTResponseHTML) > WIFI_HTTP_Response_ContentLength)
				WIFI_HTTResponseHTML[WIFI_HTTP_Response_ContentLength] = 0;

			WIFI_ProcessingCommand = WIFI_COMM_NONE;
			WIFI_State = WIFI_READY;
			if (WIFI_ProcessingCommandCallback != NULL)
				WIFI_ProcessingCommandCallback();
		}
	}
}

static void WIFI_sendHTTPRequest(void)
{
	WIFI_State = WIFI_PROCESS_COMMAND;
	WIFI_ProcessingCommand = WIFI_COMM_TCP_GET_RESPONSE;
	memset(WIFI_HTTRequest, 0x00, sizeof(WIFI_HTTRequest));
	strcat(WIFI_HTTRequest, "GET ");
	strcat(WIFI_HTTRequest, WIFI_GETuri);
	strcat(WIFI_HTTRequest, " HTTP/1.1\r\n");
	strcat(WIFI_HTTRequest, "Host: ");
	strcat(WIFI_HTTRequest, WIFI_HOSTuri);
	strcat(WIFI_HTTRequest, "\r\nConnection: close\r\n\r\n");
	char comm_line[64] = {0};
	sprintf(comm_line, "AT+CIPSEND=0,%d\r\n", strlen(WIFI_HTTRequest));
	WIFI_SendCommand(comm_line);
	WIFI_SendCommand(WIFI_HTTRequest);
}

bool WIFI_getHTTPpage(char *host, char *url, void (*callback)(void), bool https)
{
	if (WIFI_State != WIFI_READY)
		return false;
	WIFI_State = WIFI_PROCESS_COMMAND;
	WIFI_ProcessingCommand = WIFI_COMM_TCP_CONNECT;
	WIFI_ProcessingCommandCallback = callback;
	WIFI_HTTP_Response_Status = 0;

	memset(WIFI_HOSTuri, 0x00, sizeof(WIFI_HOSTuri));
	strcat(WIFI_HOSTuri, "AT+CIPSTART=0,");
	if (!https)
		strcat(WIFI_HOSTuri, "\"TCP\"");
	else
		strcat(WIFI_HOSTuri, "\"SSL\"");
	strcat(WIFI_HOSTuri, ",\"");
	strcat(WIFI_HOSTuri, host);

	if (!https)
		strcat(WIFI_HOSTuri, "\",80,10\r\n");
	else
		strcat(WIFI_HOSTuri, "\",443,10\r\n");

	memset(WIFI_GETuri, 0x00, sizeof(WIFI_GETuri));
	strcat(WIFI_GETuri, url);

	WIFI_SendCommand(WIFI_HOSTuri);

	memset(WIFI_HOSTuri, 0x00, sizeof(WIFI_HOSTuri));
	strcat(WIFI_HOSTuri, host);
	return true;
}

static void WIFI_printText_callback(void)
{
	LCDDriver_Fill(BG_COLOR);
	if (WIFI_HTTP_Response_Status == 200)
	{
		LCDDriver_printTextFont(WIFI_HTTResponseHTML, 10, 20, FG_COLOR, BG_COLOR, &FreeSans9pt7b);
	}
	else
		LCDDriver_printTextFont("Network error", 10, 20, FG_COLOR, BG_COLOR, &FreeSans9pt7b);
}

static void WIFI_printImage_stream_partial_callback(void)
{
	memset(WIFI_RLEStreamBuffer, 0x00, sizeof(WIFI_RLEStreamBuffer));
	//parse hex output from server (convert to bin)
	char *istr = WIFI_HTTResponseHTML;
	char hex[5] = {0};
	WIFI_RLEStreamBuffer_index = 0;
	int16_t val = 0;
  uint32_t len = strlen(WIFI_HTTResponseHTML);
	while (*istr != 0 && (len >= ((WIFI_RLEStreamBuffer_index * 4) + 4)))
	{
		//Get hex
		strncpy(hex, istr, 4);
		val = (int16_t)(strtol(hex, NULL, 16));
		istr += 4;
		//Save
		WIFI_RLEStreamBuffer[WIFI_RLEStreamBuffer_index] = val;
		WIFI_RLEStreamBuffer_index++;
	}
	
	//send to LCD RLE stream decoder
	LCDDriver_printImage_RLECompressed_ContinueStream(WIFI_RLEStreamBuffer, WIFI_RLEStreamBuffer_index);

	//clean answer
	if (strlen(WIFI_HTTResponseHTML) > (WIFI_RLEStreamBuffer_index * 4)) //part buffer preceed, move to begin
	{
		istr = &WIFI_HTTResponseHTML[(WIFI_RLEStreamBuffer_index * 4)];
		strcpy(WIFI_HTTResponseHTML, istr);
	}
	else
		memset(WIFI_HTTResponseHTML, 0x00, sizeof(WIFI_HTTResponseHTML));
}

static void WIFI_printImage_stream_callback(void)
{
	//image print stream done
}

static void WIFI_printImage_callback(void)
{
	LCDDriver_Fill(BG_COLOR);
	if (WIFI_HTTP_Response_Status == 200)
	{
		char *istr1 = strchr(WIFI_HTTResponseHTML, ',');
		if (istr1 != NULL)
		{
			*istr1 = 0;
			uint32_t filesize = atoi(WIFI_HTTResponseHTML);
			istr1++;
			char *istr2 = strchr(istr1, ',');
			if (istr2 != NULL)
			{
				*istr2 = 0;
				uint16_t width = (uint16_t)(atoi(istr1));
				istr2++;

				uint16_t height = (uint16_t)(atoi(istr2));

				if (filesize > 0 && width > 0 && height > 0)
				{
					LCDDriver_printImage_RLECompressed_StartStream(LCD_WIDTH / 2 - width / 2, LCD_HEIGHT / 2 - height / 2, width, height);
					WIFI_RLEStreamBuffer_part = 0;
					WIFI_getHTTPpage("ua3reo.ru", "/trx_services/propagination.php?part=0", WIFI_printImage_stream_callback, false);
				}
			}
		}
	}
	else
		LCDDriver_printTextFont("Network error", 10, 20, FG_COLOR, BG_COLOR, &FreeSans9pt7b);
}

void WIFI_getRDA(void)
{
	LCDDriver_Fill(BG_COLOR);
	if (WIFI_connected && WIFI_State == WIFI_READY)
		LCDDriver_printTextFont("Loading...", 10, 20, FG_COLOR, BG_COLOR, &FreeSans9pt7b);
	else
	{
		LCDDriver_printTextFont("No connection", 10, 20, FG_COLOR, BG_COLOR, &FreeSans9pt7b);
		return;
	}
	char url[64] = "/trx_services/rda.php?callsign=";
	strcat(url, TRX.CALLSIGN);
	WIFI_getHTTPpage("ua3reo.ru", url, WIFI_printText_callback, false);
}

void WIFI_getPropagination(void)
{
	LCDDriver_Fill(BG_COLOR);
	if (WIFI_connected && WIFI_State == WIFI_READY)
		LCDDriver_printTextFont("Loading...", 10, 20, FG_COLOR, BG_COLOR, &FreeSans9pt7b);
	else
	{
		LCDDriver_printTextFont("No connection", 10, 20, FG_COLOR, BG_COLOR, &FreeSans9pt7b);
		return;
	}
	WIFI_getHTTPpage("ua3reo.ru", "/trx_services/propagination.php", WIFI_printImage_callback, false);
}
